進貨=1
出貨=2
營業額統計=3
庫存統計=4
離開系統=5
交易=0
進=0
出=0
x=0
總收=0
應收=0
剩=0
總出=0
print('請先設定')
最初=int(input('最初有幾顆蘋果:'))
幾元=int(input('一顆幾元:'))
剩=最初
print('')
print('===========功能選單==========')
print('進貨 1')
print('出貨 2')
print('營業額統計 3')
print('庫存統計 4')
print('離開系統 5')
print('============================')
x=int(input('請選擇功能:'))
while 0<x<5:
    進=0
    出=0
    
    if x==1:
        進=int(input('[進貨]進幾顆蘋果:'))
        print('進',進,'顆蘋果')
    if x==2:
         出=int(input('[出貨]賣多少顆蘋果:'))
         if 出>剩:
             print('庫存不足，請進貨')
             出=0
         else:
             print('出貨',出,'顆蘋果')
             應收=(出*幾元)
             print('應收',應收,'元')
             交易=交易+1
             總收=總收+應收
             應收=0
             總出=總出+出
    if x==3:
        print('[營業額統計]')
        print('今天有',交易,'筆交易')
        print('賣出',總出,'顆蘋果')
        print('共收',總收,'元')
    if x==4:
        print('[庫存統計]')
        print('目前庫存:',剩,'顆蘋果')
    剩=(剩+進)-出
    print('目前庫存:',剩)
    print('')
    print('===========功能選單==========')
    print('進貨 1')
    print('出貨 2')
    print('營業額統計 3')
    print('庫存統計 4')
    print('離開系統 5')
    print('============================')
    x=int(input('請選擇功能:'))